#include <iostream>

int main() {
    std::cout << "Осень\n\n";
    std::cout << "Автор: Александр Сергеевич Пушкин\n\n";
    std::cout << "Осень, осень, осень,\n";
    std::cout << "Солнце, солнце, солнце,\n";
    std::cout << "Выходит, выходит, выходит,\n";
    std::cout << "Зачем, зачем, зачем?\n";
    std::cout << "Солнце, солнце, солнце,\n";
    std::cout << "Выходит, выходит, выходит,\n";
    std::cout << "Зачем, зачем, зачем?\n";
    std::cout << "Солнце, солнце, солнце,\n";
    std::cout << "Выходит, выходит, выходит,\n";
    std::cout << "Зачем, зачем, зачем?\n";
    std::cout << "Солнце, солнце, солнце,\n";
    std::cout << "Выходит, выходит, выходит,\n";
    std::cout << "Зачем, зачем, зачем?\n";
    return 0;
}